#+SETUPFILE: ~/.emacs.d/org-templates/template.org
#+TITLE: Bash

* жЈҖжөӢж–Үд»¶жҲ–зӣ®еҪ•жҳҜеҗҰеӯҳеңЁ
#+BEGIN_SRC shell :results output
  if [ -f "/root/.zshrc" ];
  then
      echo "~/.zshrc exists"
  else
      echo "~/.zshrc not exists"
  fi
#+END_SRC

#+RESULTS:
: ~/.zshrc exists


#+BEGIN_SRC shell :results output
  if [ -d "/root/.emacs.d" ];
  then
      echo "/root/.emacs.d exists"
  else
      echo "/root/.emacs.d not exists"
  fi
#+END_SRC

#+RESULTS:
: /root/.emacs.d exists

#+BEGIN_SRC shell :results output
  if [[ -d "/root/.emacs.d" && -d "/root/.vim" ]];
  then
      echo "/root/.emacs.d and /root/.vim exists"
  else
      echo "/root/.emacs.d or /root/.vim not exists"
  fi
#+END_SRC

#+RESULTS:
: /root/.emacs.d and /root/.vim exists


#+BEGIN_SRC shell :results output
  if [[ -d "/root/.emacs.d" || -d "/root/.vimhaha" ]];
  then
      echo "/root/.emacs.d or /root/.vimhaha exists"
  else
      echo "/root/.emacs.d and /root/.vim not exists"
  fi
#+END_SRC

#+RESULTS:
: /root/.emacs.d or /root/.vim exists


#+BEGIN_SRC shell :results output
  if [ -d "/root/.emacs.d" -a -d "/root/.vim" ];
  then
      echo "/root/.emacs.d and /root/.vim exists"
  else
      echo "/root/.emacs.d or /root/.vim not exists"
  fi

#+END_SRC

#+RESULTS:
: /root/.emacs.d and /root/.vim exists

** initial and access
#+begin_src shell
  array=(30 10 2 9 4 5)
  echo ${array}
  echo ${array[*]}
  echo ${array[@]}
  echo ${array[1]} # дёҚжҳҜд»Ҙ0дҪңдёәејҖе§Ӣ
  echo ${array[-1]}
#+end_src

#+RESULTS:
| 30 | 10 | 2 | 9 | 4 | 5 |
| 30 | 10 | 2 | 9 | 4 | 5 |
| 30 | 10 | 2 | 9 | 4 | 5 |
| 30 |    |   |   |   |   |
|  5 |    |   |   |   |   |
** append
#+begin_src shell
  array=(1 2 3 4 5)
  array+=("hello")
  array+=("python")
  echo ${array}
#+end_src

#+RESULTS:
: 1 2 3 4 5 hello python

** delete
#+begin_src shell
  array=(1 2 3 4)
  delete=3
  array=( "${array[@]/$delete}" )
  echo ${array}
#+end_src

#+RESULTS:
: 1 2 4

** iterator
#+begin_src shell
  #!/bin/bash
  array=(1 9 10 8 7)
  echo ${array[@]:1:2}
#+end_src

#+RESULTS:
: 9 10

#+begin_src shell
  array=(1 2 9 4 5)
  for t in ${array[@]}; do
      echo ${t}
  done
#+end_src

#+RESULTS:
| 1 |
| 2 |
| 9 |
| 4 |
| 5 |

** length
#+begin_src shell
  array=(1 2 3 4 5)
  echo "ж•°з»„е…ғзҙ дёӘж•°дёә: ${#array[*]}"
  echo "ж•°з»„е…ғзҙ дёӘж•°дёә: ${#array[@]}"
#+end_src

#+RESULTS:
| ж•°з»„е…ғзҙ дёӘж•°дёә: | 5 |
| ж•°з»„е…ғзҙ дёӘж•°дёә: | 5 |

